{
  "metadata": {
    "total_size": 15645600384
  },
  "weight_map": {
    "freqs_cis": "model-00001-of-00004.safetensors",
    "lm_head.weight": "model-00004-of-00004.safetensors",
    "transformer.adapter.weight": "model-00001-of-00004.safetensors",
    "transformer.coda.0.attn.Wqkv.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.0.attn.proj.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.0.attn.qk_bias": "model-00003-of-00004.safetensors",
    "transformer.coda.0.mlp.fc.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.0.mlp.proj.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.0.norm_1.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.0.norm_2.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.0.norm_3.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.0.norm_4.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.attn.Wqkv.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.attn.proj.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.attn.qk_bias": "model-00003-of-00004.safetensors",
    "transformer.coda.1.mlp.fc.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.mlp.proj.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.norm_1.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.norm_2.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.norm_3.weight": "model-00003-of-00004.safetensors",
    "transformer.coda.1.norm_4.weight": "model-00003-of-00004.safetensors",
    "transformer.core_block.0.attn.Wqkv.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.0.attn.proj.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.0.attn.qk_bias": "model-00001-of-00004.safetensors",
    "transformer.core_block.0.mlp.fc.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.0.mlp.proj.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.0.norm_1.weight": "model-00001-of-00004.safetensors",
    "transformer.core_block.0.norm_2.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.0.norm_3.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.0.norm_4.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.attn.Wqkv.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.attn.proj.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.attn.qk_bias": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.mlp.fc.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.mlp.proj.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.norm_1.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.norm_2.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.norm_3.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.1.norm_4.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.attn.Wqkv.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.attn.proj.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.attn.qk_bias": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.mlp.fc.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.mlp.proj.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.norm_1.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.norm_2.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.norm_3.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.2.norm_4.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.3.attn.Wqkv.weight": "model-00003-of-00004.safetensors",
    "transformer.core_block.3.attn.proj.weight": "model-00003-of-00004.safetensors",
    "transformer.core_block.3.attn.qk_bias": "model-00002-of-00004.safetensors",
    "transformer.core_block.3.mlp.fc.weight": "model-00003-of-00004.safetensors",
    "transformer.core_block.3.mlp.proj.weight": "model-00003-of-00004.safetensors",
    "transformer.core_block.3.norm_1.weight": "model-00002-of-00004.safetensors",
    "transformer.core_block.3.norm_2.weight": "model-00003-of-00004.safetensors",
    "transformer.core_block.3.norm_3.weight": "model-00003-of-00004.safetensors",
    "transformer.core_block.3.norm_4.weight": "model-00003-of-00004.safetensors",
    "transformer.ln_f.weight": "model-00003-of-00004.safetensors",
    "transformer.prelude.0.attn.Wqkv.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.attn.proj.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.attn.qk_bias": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.mlp.fc.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.mlp.proj.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.norm_1.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.norm_2.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.norm_3.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.0.norm_4.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.attn.Wqkv.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.attn.proj.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.attn.qk_bias": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.mlp.fc.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.mlp.proj.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.norm_1.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.norm_2.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.norm_3.weight": "model-00001-of-00004.safetensors",
    "transformer.prelude.1.norm_4.weight": "model-00001-of-00004.safetensors",
    "transformer.wte.weight": "model-00001-of-00004.safetensors"
  }
}
