{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 65504,
      "content": "<|begin_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65505,
      "content": "<|end_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65506,
      "content": "<|begin_header|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65507,
      "content": "<|end_header|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65508,
      "content": "<|end_turn|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65509,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65510,
      "content": "<|fim_prefix|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65511,
      "content": "<|fim_middle|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65512,
      "content": "<|fim_suffix|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65513,
      "content": "<|fim_pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65514,
      "content": "<|...|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65515,
      "content": "<|del|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65516,
      "content": "<|c_0|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65517,
      "content": "<|c_1|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65518,
      "content": "<|c_2|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65519,
      "content": "<|c_3|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65520,
      "content": "<|c_4|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65521,
      "content": "<|c_5|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65522,
      "content": "<|c_6|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65523,
      "content": "<|c_7|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65524,
      "content": "<|c_8|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65525,
      "content": "<|c_9|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65526,
      "content": "<|?|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65527,
      "content": "<|&|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65528,
      "content": "<|!|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65529,
      "content": "<|-|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65530,
      "content": "<|+|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65531,
      "content": "<|interrupt|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65532,
      "content": "<|>>-|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65533,
      "content": "<|-<<|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65534,
      "content": "<|->>|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65535,
      "content": "<|<<-|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "(\\\\n(?:e(?:wcommand|wenvironment|wline|wpage|wtheorem)|abla|e|eq|geq|gtr|leq|exists|ocite|oindent|olinebreak|onumber|opagebreak|ormalsize|ot(?!(?:ag\\b|\\b)))\\b|\\n+|\\\\n(?!\\b)|[ \\t]?(?:==|!=|<=|>=|<<|>>|\\*\\*|//|\\+=|-=|\\*=|/=|%=|&=|\\|=|\\^=|<<=|>>=|\\*\\*=|//=|:=|\\+\\+|--|[\\p{L}]+['’ʼ](?:\\p{L}+)\\b|\\\\[a-zA-Z]+|\\\\{|\\\\}|{|}|\\\\\\[|\\\\\\]|\\[|\\]|\\(|\\)|_+|\\||\\+|-|\\*|—|-|=|[.,!?;()]|\\$\\$?|`+|\\\"+|\\#+|\\p{N}+(?:st|nd|rd|th)|\\p{N}{1,1}|[^\\r\\n\\p{L}\\p{N}]?\\p{L}+|[\\p{P}\\p{S}]+)|\\s+|\\p{So})"
        },
        "behavior": "Removed",
        "invert": true
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|begin_text|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|begin_text|>": {
        "id": "<|begin_text|>",
        "ids": [
          65504
        ],
        "tokens": [
          "<|begin_text|>"
        ]
      },
      "<|end_text|>": {
        "id": "<|end_text|>",
        "ids": [
          65505
        ],
        "tokens": [
          "<|end_text|>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "Ā": 0,
      "ā": 1,
      "Ă": 2,
      "ă": 3,
      "Ą": 4,
      "ą": 5,
      "Ć": 6,
      "ć": 7,
      "Ĉ": 8,
      "ĉ": 9,
      "Ċ": 10,
      "ċ": 11,
      "Č": 12,
      "č": 13,
      "Ď": 14,
      "ď": 15,
      "Đ": 16,
      "đ": 17,
      "Ē": 18,
      "ē": 19,
      "Ĕ": 20,
      "ĕ": 21,
      "Ė": 22,
      "ė": 23,
      "Ę": 24,
      "ę": 25,
      "Ě": 26,
      "ě": 27,
      "Ĝ": 28,
      "ĝ": 29,
      "Ğ": 30,
      "ğ": 31,
      "Ġ": 32,
      "!": 33,
      "\"": 34,
      "#": 35,
      "$": 36,
      "%": 37,
      "&": 38,
      "'": 39,
      "(": 40,
      ")": 41,
      "*": 42,
      "+": 43,
      ",": 44,
      "-": 45,
      ".": 46,
      "/": 47,
      "0": 48,
      "1": 49,
      "2": 50,
      "3": 51,
      "4": 52,
      "5": 53,
      "6": 54,
      "7": 55,
      "8": 56,
      "9": 57,
      ":": 58,
      ";": 59,
      "<": 60,
      "=": 61,
      ">": 62,
      "?": 63,
      "@": 64,
      "A": 65,
      "B": 66,
      "C": 67,
      "D": 68,
      "E": 69,
      "F": 70,
      "G": 71,
      "H": 72,
      "I": 73,
      "J": 74,
      "K": 75,
      "L": 76,
      "M": 77,
      "N": 78,
      "O": 79,
      "P": 80,
      "Q": 81,
      "R": 82,
      "S": 83,
      "T": 84,
      "U": 85,
      "V": 86,
      "W": 87,
      "X": 88,
      "Y": 89,
      "Z": 90,
      "[": 91,
      "\\": 92,
      "]": 93,
      "^": 94,
      "_": 95,
      "`": 96,
      "a": 97,
      "b": 98,
      "c": 99,
      "d": 100,
      "e": 101,
      "f": 102,
      "g": 103,
      "h": 104,
      "i": 105,
      "j": 106,
      "k": 107,
      "l": 108,
      "m": 109,
      "n": 110,
      "o": 111,
      "p": 112,
      "q": 113,
      "r": 114,
      "s": 115,
      "t": 116,
      "u": 117,
      "v": 118,
      "w": 119,
      "x": 120,
      "y": 121,
      "z": 122,
      "{": 123,
      "|": 124,
      "}": 125,
      "~": 126,
      "ġ": 127,
      "Ģ": 128,
      "ģ": 129,
      "Ĥ": 130,
      "ĥ": 131,
      "Ħ": 132,
      "ħ": 133,
      "Ĩ": 134,
      "ĩ": 135,
      "Ī": 136,
      "ī": 137,
      "Ĭ": 138,
      "ĭ": 139,
      "Į": 140,
      "į": 141,
      "İ": 142,
      "ı": 143,
      "Ĳ": 144,
      "ĳ": 145,
      "Ĵ": 146,
      "ĵ": 147,
      "Ķ": 148,
      "ķ": 149,
      "ĸ": 150,
      "Ĺ": 151,
      "ĺ": 152,
      "Ļ": 153,
      "ļ": 154,
      "Ľ": 155,
      "ľ": 156,
      "Ŀ": 157,
      "ŀ": 158,
      "Ł": 159,
      "ł": 160,
      "¡": 161,
      "¢": 162,
      "£": 163,
      "¤": 164,
      "¥": 165,
      "¦": 166,
      "§": 167,
      "¨": 168,
      "©": 169,
      "ª": 170,
      "«": 171,
      "¬": 172,
      "Ń": 173,
      "®": 174,
      "¯": 175,
      "°": 176,
      "±": 177,
      "²": 178,
      "³": 179,
      "´": 180,
      "µ": 181,
      "¶": 182,
      "·": 183,
      "¸": 184,
      "¹": 185,
      "º": 186,
      "»": 187,
      "¼": 188,
      "½": 189,
      "¾": 190,
      "¿": 191,
      "À": 192,
      "Á": 193,
      "Â": 194,
      "Ã": 195,
      "Ä": 196,
      "Å": 197,
      "Æ": 198,
      "Ç": 199,
      "È": 200,
      "É": 201,
      "Ê": 202,
      "Ë": 203,
      "Ì": 204,
      "Í": 205,
      "Î": 206,
      "Ï": 207,
      "Ð": 208,
      "Ñ": 209,
      "Ò": 210,
      "Ó": 211,
      "Ô": 212,
      "Õ": 213,
      "Ö": 214,
      "×": 215,
      "Ø": 216,
      "Ù": 217,
      "Ú": 218,
      "Û": 219,
      "Ü": 220,
      "Ý": 221,
      "Þ": 222,
      "ß": 223,
      "à": 224,
      "á": 225,
      "â": 226,
      "ã": 227,
      "ä": 228,
      "å": 229,
      "æ": 230,
      "ç": 231,
      "è": 232,
      "é": 233,
      "ê": 234,
      "ë": 235,
      "ì": 236,
      "í": 237,
      "î": 238,
      "ï": 239,
      "ð": 240,
      "ñ": 241,
      "ò": 242,
      "ó": 243,
      "ô": 244,
      "õ": 245,
      "ö": 246,
      "÷": 247,
      "ø": 248,
      "ù": 249,
      "ú": 250,
      "û": 251,
      "ü": 252,
      "ý": 253,
      "þ": 254,
      "ÿ": 255,
      "ĠĠ": 256,
      "th": 257,
      "in": 258,
      "Ġa": 259,
      "on": 260,
      "Ġth": 261,
      "re": 262,
      "ti": 263,
      "Ġthe": 264,
      "er": 265,
      "Ġ\\": 266,
      "en": 267,
      "ĠĠĠĠ": 268,
      "Ġ$": 269,
      "al": 270,
      "Ġs": 271,
      "or": 272,
      "Ġc": 273,
      "ma": 274,
      "Ġo": 275,
      "is": 276,
      "le": 277,
      "te": 278,
      "tion": 279,
      "Ġf": 280,
      "nd": 281,
      "ar": 282,
      "Ġw": 283,
      "es": 284,
      "Ġt": 285,
      "Ġof": 286,
      "Ġp": 287,
      "ra": 288,
      "ro": 289,
      "ta": 290,
      "Ġin": 291,
      "ing": 292,
      "Ġb": 293,
      "Ġd": 294,
      "Ġand": 295,
      "at": 296,
      "ig": 297,
      "el": 298,
      "la": 299,
      "ed": 300,
      "ĊĊ": 301,
      "Ġto": 302,
      "ic": 303,
      "Ġe": 304,
      "Ġis": 305,
      "ĠĠĠĠĠĠĠĠ": 306,
      "me": 307,
      "it": 308,
      "an": 309,
      "se": 310,
      "Ġn": 311,
      "math": 312,
      "Ġh": 313,
      "ou": 314,
      "si": 315,
      "ol": 316,
      "qu": 317,
      "Ġ(": 318,
      "^{": 319,
      "mp": 320,
      "Ġre": 321,
      "he": 322,
      "st": 323,
      "ent": 324,
      "ve": 325,
      "ce": 326,
      "\\b": 327,
      "Ġ=": 328,
      "de": 329,
      "Ġfor": 330,
      "Ġm": 331,
      "ation": 332,
      "ch": 333,
      "lo": 334,
      "ct": 335,
      "Ġg": 336,
      "Ġthat": 337,
      "\\math": 338,
      "su": 339,
      "ĠT": 340,
      "ly": 341,
      "Ġu": 342,
      "end": 343,
      "et": 344,
      "Ġ1": 345,
      "ver": 346,
      "ot": 347,
      "Ġcon": 348,
      "Ġ0": 349,
      "ph": 350,
      "ri": 351,
      "as": 352,
      "ith": 353,
      "cal": 354,
      "mb": 355,
      "eg": 356,
      "igh": 357,
      "Ġwe": 358,
      "ction": 359,
      "Ġi": 360,
      "Ġon": 361,
      "ci": 362,
      "ge": 363,
      "Ġpro": 364,
      "fra": 365,
      "Ġco": 366,
      "Ġbe": 367,
      "ft": 368,
      "il": 369,
      "ref": 370,
      "ight": 371,
      "egin": 372,
      "ur": 373,
      "Ġan": 374,
      "Ġma": 375,
      "Ġas": 376,
      "čĊ": 377,
      "ow": 378,
      "Ġwith": 379,
      "frac": 380,
      "ĠI": 381,
      "Ġl": 382,
      "Ġal": 383,
      "ĠS": 384,
      "Ġex": 385,
      "ul": 386,
      "od": 387,
      "Ġsu": 388,
      "pp": 389,
      "ted": 390,
      "ble": 391,
      "ut": 392,
      "Ġ&": 393,
      "ĠA": 394,
      "Ġv": 395,
      "\\r": 396,
      "im": 397,
      "ine": 398,
      "eta": 399,
      "res": 400,
      "am": 401,
      "Ġ2": 402,
      "om": 403,
      "Ġby": 404,
      "\\begin": 405,
      "id": 406,
      "Ġare": 407,
      "ore": 408,
      "ter": 409,
      "Ġ-": 410,
      "equ": 411,
      "\\in": 412,
      "ad": 413,
      "pe": 414,
      "Ġwh": 415,
      "un": 416,
      "ĠC": 417,
      "ir": 418,
      "\\la": 419,
      "ĠĊ": 420,
      "Ġde": 421,
      "ity": 422,
      "eq": 423,
      "\\end": 424,
      "Ġ+": 425,
      "if": 426,
      "ts": 427,
      "ĠThe": 428,
      "da": 429,
      "\\p": 430,
      "Ġit": 431,
      "tex": 432,
      "per": 433,
      "ment": 434,
      "Ġ{": 435,
      "iv": 436,
      "Ġy": 437,
      "left": 438,
      "bel": 439,
      "\\mathb": 440,
      "us": 441,
      "Ġor": 442,
      "to": 443,
      "Ġcan": 444,
      "ĠF": 445,
      "ĠB": 446,
      "Ġst": 447,
      "tic": 448,
      "ate": 449,
      "ĠL": 450,
      "dot": 451,
      "ĠP": 452,
      "mple": 453,
      "ran": 454,
      "rom": 455,
      "low": 456,
      "Ġha": 457,
      "equation": 458,
      "for": 459,
      "ome": 460,
      "Ġthis": 461,
      "\\mathcal": 462,
      "iz": 463,
      "ck": 464,
      "ers": 465,
      "pha": 466,
      "Ġme": 467,
      "ĠR": 468,
      "ĠM": 469,
      "nt": 470,
      "ure": 471,
      "Ġse": 472,
      "um": 473,
      "cite": 474,
      "The": 475,
      "alpha": 476,
      "text": 477,
      "pa": 478,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 479,
      "\\c": 480,
      "\\frac": 481,
      "ĠH": 482,
      "tim": 483,
      "ign": 484,
      "ga": 485,
      "ss": 486,
      "\\s": 487,
      "ces": 488,
      "ĠN": 489,
      "Ġpo": 490,
      "ame": 491,
      "tial": 492,
      "ĠW": 493,
      "Ġat": 494,
      "Ġle": 495,
      "^{\\": 496,
      "ist": 497,
      "tions": 498,
      "int": 499,
      "Ġsh": 500,
      "tive": 501,
      "Ġfrom": 502,
      "**": 503,
      "mbda": 504,
      "ys": 505,
      "mu": 506,
      "ru": 507,
      "Ġ\\b": 508,
      "ĉĉ": 509,
      "sion": 510,
      "ich": 511,
      "\\right": 512,
      "ĠE": 513,
      "Ġx": 514,
      "Ġus": 515,
      "du": 516,
      "ite": 517,
      "\\n": 518,
      "ho": 519,
      "ence": 520,
      "Ġk": 521,
      "di": 522,
      "ĠĠĠ": 523,
      "Ġhave": 524,
      "fe": 525,
      "of": 526,
      "lu": 527,
      "ds": 528,
      "ĠTh": 529,
      "ther": 530,
      "Ġ\\math": 531,
      "Ġ3": 532,
      "ĠD": 533,
      "\\label": 534,
      "amma": 535,
      "elta": 536,
      "Ġne": 537,
      "are": 538,
      "pro": 539,
      "here": 540,
      "rou": 541,
      "times": 542,
      "\\\\": 543,
      "\\mathbb": 544,
      "ach": 545,
      "ell": 546,
      "con": 547,
      "Ġpar": 548,
      "line": 549,
      "lon": 550,
      "psi": 551,
      "act": 552,
      "unction": 553,
      "Ġ[": 554,
      "til": 555,
      "\\alpha": 556,
      "ab": 557,
      "ms": 558,
      "\\left": 559,
      "co": 560,
      "Ġsta": 561,
      "Ġ\\in": 562,
      "Ġwhich": 563,
      "\\,": 564,
      "umb": 565,
      "ari": 566,
      "Ġyou": 567,
      "igma": 568,
      "Ġcomp": 569,
      "der": 570,
      "alu": 571,
      "all": 572,
      "gle": 573,
      "po": 574,
      "~\\": 575,
      "phi": 576,
      "Ġ\\cite": 577,
      "right": 578,
      "\\su": 579,
      "ener": 580,
      "^{-": 581,
      "'s": 582,
      "ase": 583,
      "ill": 584,
      "fin": 585,
      "row": 586,
      "ap": 587,
      "psilon": 588,
      "ke": 589,
      "ĠG": 590,
      "ical": 591,
      "Ġapp": 592,
      "Ġ:": 593,
      "Ġun": 594,
      "rm": 595,
      "Ġfunction": 596,
      "$$": 597,
      "Ġnot": 598,
      "Ġif": 599,
      "##": 600,
      "ies": 601,
      "leq": 602,
      "op": 603,
      "\\v": 604,
      "ne": 605,
      "red": 606,
      "Ġ\\frac": 607,
      "ide": 608,
      "Ġch": 609,
      "Ġequ": 610,
      "Ġall": 611,
      "^\\": 612,
      "set": 613,
      "ollow": 614,
      "ld": 615,
      "Ġ\\end": 616,
      "tain": 617,
      "so": 618,
      "hat": 619,
      "\\d": 620,
      "tri": 621,
      "Ġ\"": 622,
      "ary": 623,
      "Ġset": 624,
      "dots": 625,
      "Ġfollow": 626,
      "Ġlo": 627,
      "\\}": 628,
      "Ġqu": 629,
      "Ġob": 630,
      "ound": 631,
      "gra": 632,
      "the": 633,
      "umber": 634,
      "tr": 635,
      "Ġmod": 636,
      "align": 637,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 638,
      "Ġsuch": 639,
      "--": 640,
      "Ġ}": 641,
      "vel": 642,
      "Ġ4": 643,
      "able": 644,
      "ind": 645,
      "Ġra": 646,
      "Ġen": 647,
      "tilde": 648,
      "fig": 649,
      "ous": 650,
      "\\lambda": 651,
      "sta": 652,
      "Ġno": 653,
      "Ġ\\\\": 654,
      "ray": 655,
      "xi": 656,
      "pace": 657,
      "Ġdis": 658,
      "and": 659,
      "mma": 660,
      "ĠIn": 661,
      "fty": 662,
      "Ġ\\ref": 663,
      "cu": 664,
      "ant": 665,
      "Ġda": 666,
      "fic": 667,
      "Ġsa": 668,
      "ps": 669,
      "\\|": 670,
      "\\o": 671,
      "ex": 672,
      "theta": 673,
      "Ġhas": 674,
      "olu": 675,
      "nce": 676,
      "\\{": 677,
      "Ġthen": 678,
      "wo": 679,
      "Ġpa": 680,
      "Ġab": 681,
      "Ġimp": 682,
      "Ġad": 683,
      "Ġone": 684,
      "gamma": 685,
      "In": 686,
      "ations": 687,
      "orem": 688,
      "ĠO": 689,
      "ator": 690,
      "ular": 691,
      "je": 692,
      "par": 693,
      "elf": 694,
      "Ġsub": 695,
      "we": 696,
      "clu": 697,
      "sul": 698,
      "Ġla": 699,
      "ile": 700,
      "fere": 701,
      "ork": 702,
      "\\text": 703,
      "ty": 704,
      "Ġwhere": 705,
      "lic": 706,
      "ding": 707,
      "Ġr": 708,
      "ould": 709,
      "our": 710,
      "Ġdo": 711,
      "vi": 712,
      "out": 713,
      "Ġte": 714,
      "eqref": 715,
      "min": 716,
      "Ġwill": 717,
      "\\mathbf": 718,
      "ree": 719,
      "ong": 720,
      "tau": 721,
      "\\mu": 722,
      "time": 723,
      "Ġâ": 724,
      "Ġper": 725,
      "gh": 726,
      "Ġeach": 727,
      "``": 728,
      "Ġtwo": 729,
      "tes": 730,
      "Ġso": 731,
      "tation": 732,
      "array": 733,
      "Ġar": 734,
      "orm": 735,
      "ges": 736,
      "ak": 737,
      "og": 738,
      "Ġvalu": 739,
      "Ġexp": 740,
      "Ġdif": 741,
      "Ġ5": 742,
      "ĠWe": 743,
      "sure": 744,
      "\\l": 745,
      "Ġ\\begin": 746,
      "ess": 747,
      "ĠK": 748,
      "Ġgiv": 749,
      "Ġthere": 750,
      "ting": 751,
      "Ġj": 752,
      "Ġgener": 753,
      "ally": 754,
      "Th": 755,
      "Ġany": 756,
      "Ġhe": 757,
      "Ġres": 758,
      "os": 759,
      "Ġ\\c": 760,
      "Ġ|": 761,
      "Ġresul": 762,
      "Ġac": 763,
      "ample": 764,
      "section": 765,
      "item": 766,
      "ents": 767,
      "ctor": 768,
      "\\e": 769,
      "ĠV": 770,
      "Ġsome": 771,
      "arrow": 772,
      "ox": 773,
      "cess": 774,
      "\\sigma": 775,
      "li": 776,
      "Ġdata": 777,
      "^*": 778,
      "Ġshow": 779,
      "ard": 780,
      "rt": 781,
      "ĠU": 782,
      "irst": 783,
      "hi": 784,
      "\\pi": 785,
      "Ġnumber": 786,
      "ties": 787,
      "bb": 788,
      "Ġ\\la": 789,
      "We": 790,
      "\\beta": 791,
      "Ġinter": 792,
      "ser": 793,
      "tra": 794,
      "pt": 795,
      "bu": 796,
      "quad": 797,
      "Ġfi": 798,
      "omega": 799,
      "Ġmo": 800,
      "ments": 801,
      "Ġev": 802,
      "ĠThis": 803,
      "ince": 804,
      "ves": 805,
      "^{(": 806,
      "rans": 807,
      "\\par": 808,
      "bf": 809,
      "app": 810,
      "Ġdi": 811,
      "ated": 812,
      "Ġver": 813,
      "Ġmodel": 814,
      "Ġalso": 815,
      "Ġinte": 816,
      "sum": 817,
      "Ġspe": 818,
      "qrt": 819,
      "mm": 820,
      "ort": 821,
      "ose": 822,
      "\\gamma": 823,
      "ote": 824,
      "ay": 825,
      "\\theta": 826,
      "trix": 827,
      "Ġcor": 828,
      "sition": 829,
      "one": 830,
      "tical": 831,
      "def": 832,
      "Ġdiffere": 833,
      "yste": 834,
      "ion": 835,
      "Ġout": 836,
      "\\rm": 837,
      "Ġ\\eqref": 838,
      "ens": 839,
      "Ġvari": 840,
      "ility": 841,
      "Ġ\\right": 842,
      "put": 843,
      "Ġdefin": 844,
      "Ġbet": 845,
      "urn": 846,
      "les": 847,
      "Ġ*": 848,
      "ize": 849,
      "mega": 850,
      "oth": 851,
      "ast": 852,
      "its": 853,
      "age": 854,
      "ust": 855,
      "Ġits": 856,
      "Omega": 857,
      "arepsilon": 858,
      "au": 859,
      "\\tau": 860,
      "Ġwas": 861,
      "Ġgra": 862,
      "ie": 863,
      "Ġonly": 864,
      "Ġour": 865,
      "Ġtime": 866,
      "Ġcla": 867,
      "forma": 868,
      "led": 869,
      "Ġz": 870,
      "Ġ<": 871,
      "cre": 872,
      "\\rho": 873,
      "Ġusing": 874,
      "pon": 875,
      "cri": 876,
      "Ġtheir": 877,
      "yn": 878,
      "Ġgiven": 879,
      "Ġrep": 880,
      "lation": 881,
      "ĠX": 882,
      "\\delta": 883,
      "olds": 884,
      "Ġover": 885,
      "\\bf": 886,
      "ĠQ": 887,
      "Ġuse": 888,
      "sf": 889,
      "ced": 890,
      "mo": 891,
      "geq": 892,
      "Ġ6": 893,
      "\\sub": 894,
      "\\partial": 895,
      "\\ref": 896,
      "Ġfollowing": 897,
      "sub": 898,
      "\\leq": 899,
      "nder": 900,
      "dition": 901,
      "Ġcase": 902,
      "\\big": 903,
      "\\sum": 904,
      "Delta": 905,
      "now": 906,
      "Ġthese": 907,
      "Ġmore": 908,
      "gor": 909,
      "\\mathrm": 910,
      "Ġdes": 911,
      "olution": 912,
      "Ġ\\left": 913,
      "wide": 914,
      "cted": 915,
      "Ġpla": 916,
      "ĠĊĊ": 917,
      "Ġcomple": 918,
      "Ġop": 919,
      "proof": 920,
      "ef": 921,
      "Ġfirst": 922,
      "Ġbound": 923,
      "Ġele": 924,
      "Ġother": 925,
      "als": 926,
      "Ġman": 927,
      "Ġnon": 928,
      "ise": 929,
      "\\phi": 930,
      "tric": 931,
      "ween": 932,
      "Ġro": 933,
      "Ġinto": 934,
      "Ġ**": 935,
      "Ġproble": 936,
      "Ġsyste": 937,
      "ĠJ": 938,
      "Ġtra": 939,
      "\\P": 940,
      "eqn": 941,
      "Ġbut": 942,
      "bra": 943,
      "Ġwhen": 944,
      "perator": 945,
      "ension": 946,
      "ulti": 947,
      "cy": 948,
      "ok": 949,
      "Ġbetween": 950,
      "Ġli": 951,
      "^n": 952,
      "Ġ\\n": 953,
      "Ġcont": 954,
      "Gamma": 955,
      "Ġprov": 956,
      "\\omega": 957,
      "pend": 958,
      "sider": 959,
      "Ġcol": 960,
      "Ġ`": 961,
      "gu": 962,
      "cor": 963,
      "ry": 964,
      "Ġcal": 965,
      "Ġpre": 966,
      "frak": 967,
      "very": 968,
      "Ġfin": 969,
      "den": 970,
      "\\var": 971,
      "Ġ\\text": 972,
      "ll": 973,
      "Ġline": 974,
      "Ġappro": 975,
      "ruct": 976,
      "ĠFor": 977,
      "ud": 978,
      "âĢ": 979,
      "\\tilde": 980,
      "Ġ'": 981,
      "log": 982,
      "ĠĠĠĠĠĠ": 983,
      "Ġtrans": 984,
      "ality": 985,
      "Ġ\\leq": 986,
      "\\Omega": 987,
      "ric": 988,
      "Ġthan": 989,
      "ger": 990,
      "Let": 991,
      "stra": 992,
      "ors": 993,
      "\\ell": 994,
      "self": 995,
      "man": 996,
      "\\xi": 997,
      "verline": 998,
      "ack": 999,
      "thod": 1000,
      "Ġ\\mathbb": 1001,
      "Ġdist": 1002,
      "ving": 1003,
      "name": 1004,
      "Ġter": 1005,
      "\\cdot": 1006,
      "čĊčĊ": 1007,
      "ĠY": 1008,
      "space": 1009,
      "up": 1010,
      "Ġ\\mathcal": 1011,
      "ics": 1012,
      "_{": 1013,
      "Ġgrou": 1014,
      "Ġes": 1015,
      "ze": 1016,
      "ngle": 1017,
      "pl": 1018,
      "Ġfact": 1019,
      "Ġ$$": 1020,
      "ject": 1021,
      "cti": 1022,
      "Ġform": 1023,
      "sed": 1024,
      "main": 1025,
      "Ġreg": 1026,
      "rangle": 1027,
      "Ġstate": 1028,
      "Ġfe": 1029,
      "ating": 1030,
      "Ġsi": 1031,
      "Ġ\\e": 1032,
      "Ġ\\s": 1033,
      "\\varepsilon": 1034,
      "')": 1035,
      "\\hat": 1036,
      "Ġbas": 1037,
      "Ġ\\,": 1038,
      "ory": 1039,
      "ints": 1040,
      "fici": 1041,
      "Ġsee": 1042,
      "\\bar": 1043,
      "cc": 1044,
      "ymb": 1045,
      "olog": 1046,
      "sh": 1047,
      "Ġ7": 1048,
      "tit": 1049,
      "\\h": 1050,
      "ymbol": 1051,
      "ctive": 1052,
      "ative": 1053,
      "Ġobtain": 1054,
      "\\[": 1055,
      "Ġ8": 1056,
      "\\int": 1057,
      "Ġden": 1058,
      "old": 1059,
      "est": 1060,
      "ential": 1061,
      "form": 1062,
      "turn": 1063,
      "Ġexample": 1064,
      "Ġef": 1065,
      "ag": 1066,
      "mall": 1067,
      "ance": 1068,
      "Ġyour": 1069,
      "ish": 1070,
      "ization": 1071,
      "&\\": 1072,
      "ameter": 1073,
      "graph": 1074,
      "Ġph": 1075,
      "ssi": 1076,
      "\\Delta": 1077,
      "Ġlet": 1078,
      "Ġneed": 1079,
      "\\sqrt": 1080,
      "ĠPro": 1081,
      "Ġvalue": 1082,
      "Ġthey": 1083,
      "idth": 1084,
      "Ġwork": 1085,
      "\\infty": 1086,
      "eld": 1087,
      "Ġ_": 1088,
      "ub": 1089,
      "com": 1090,
      "ists": 1091,
      "\\eta": 1092,
      "pla": 1093,
      "Ġrela": 1094,
      "Ġup": 1095,
      "inu": 1096,
      "Ġhow": 1097,
      "Ġanal": 1098,
      "Ġspace": 1099,
      "vector": 1100,
      "Ġsame": 1101,
      "Ġmethod": 1102,
      "',": 1103,
      "eqnarray": 1104,
      "rc": 1105,
      "ĠLet": 1106,
      "Big": 1107,
      "Ġcur": 1108,
      "Ġpoint": 1109,
      "Ġ\\label": 1110,
      "ord": 1111,
      "mod": 1112,
      "val": 1113,
      "ear": 1114,
      "Ġclass": 1115,
      "Ġused": 1116,
      "mph": 1117,
      "\\item": 1118,
      "Ġknow": 1119,
      "tima": 1120,
      "Ġevery": 1121,
      "Ġpol": 1122,
      "\\wide": 1123,
      "ĊĊĊ": 1124,
      "orph": 1125,
      "cent": 1126,
      "Ġpres": 1127,
      "Ġproblem": 1128,
      "rk": 1129,
      "figure": 1130,
      "clude": 1131,
      "\\]": 1132,
      "ype": 1133,
      "Ġfind": 1134,
      "ni": 1135,
      "\\Gamma": 1136,
      "gorith": 1137,
      "ial": 1138,
      "Ġrepres": 1139,
      "Ġorder": 1140,
      "Ġget": 1141,
      "Ġfollows": 1142,
      "imension": 1143,
      "For": 1144,
      "ip": 1145,
      "\\epsilon": 1146,
      "ĠIt": 1147,
      "ning": 1148,
      "ĠIf": 1149,
      "ases": 1150,
      "infty": 1151,
      "ring": 1152,
      "\\times": 1153,
      "gth": 1154,
      "where": 1155,
      "Ġdifferent": 1156,
      "\\psi": 1157,
      "\\!": 1158,
      "ever": 1159,
      "Ġ9": 1160,
      "ten": 1161,
      "Ġmea": 1162,
      "abla": 1163,
      "Ġmulti": 1164,
      "Ġspeci": 1165,
      "vely": 1166,
      "Ġgo": 1167,
      "rough": 1168,
      "Ġboth": 1169,
      "Ġconsider": 1170,
      "tep": 1171,
      "ved": 1172,
      "Ġproper": 1173,
      "\\varphi": 1174,
      "ition": 1175,
      "Ġprodu": 1176,
      "ized": 1177,
      "umer": 1178,
      "\\cap": 1179,
      "ribu": 1180,
      "ĠLe": 1181,
      "Ġ\\sum": 1182,
      "ctions": 1183,
      "Ġmay": 1184,
      "\\mathfrak": 1185,
      "Ġmean": 1186,
      "tab": 1187,
      "\\k": 1188,
      "ĠThen": 1189,
      "ice": 1190,
      "respon": 1191,
      "formation": 1192,
      "Ġsim": 1193,
      "tisf": 1194,
      "ures": 1195,
      "pi": 1196,
      "ual": 1197,
      "Ġequation": 1198,
      "\\to": 1199,
      "ount": 1200,
      "gy": 1201,
      "cus": 1202,
      "refore": 1203,
      "circ": 1204,
      "Ġsystem": 1205,
      "Ġlar": 1206,
      "ĠRe": 1207,
      "ature": 1208,
      "sec": 1209,
      "ove": 1210,
      "Ġhigh": 1211,
      "ero": 1212,
      "position": 1213,
      "Ġ\\o": 1214,
      "comp": 1215,
      "La": 1216,
      "Ġpartic": 1217,
      "Ġrespe": 1218,
      "cond": 1219,
      "Ġ.": 1220,
      "This": 1221,
      "\\overline": 1222,
      "fa": 1223,
      "\\S": 1224,
      "oldsymbol": 1225,
      "table": 1226,
      "sc": 1227,
      "ian": 1228,
      "Ġproof": 1229,
      "matrix": 1230,
      "Ġresults": 1231,
      "work": 1232,
      "width": 1233,
      "ĠTheorem": 1234,
      "Ġ>": 1235,
      "Ġabout": 1236,
      "pri": 1237,
      "Ġ,": 1238,
      "Ġgraph": 1239,
      "Ġsatisf": 1240,
      "Ġchar": 1241,
      "Ġprocess": 1242,
      "ix": 1243,
      "ism": 1244,
      "Ġsp": 1245,
      "Ġsc": 1246,
      "Ġcho": 1247,
      "gebra": 1248,
      "\"\"": 1249,
      "raw": 1250,
      "Ġnew": 1251,
      "ability": 1252,
      "::": 1253,
      "Ġinde": 1254,
      "Ġ/": 1255,
      "ful": 1256,
      "ym": 1257,
      "Ġint": 1258,
      "Ġwould": 1259,
      "sing": 1260,
      "Ġ)": 1261,
      "'}": 1262,
      "Ġresult": 1263,
      "Ġassu": 1264,
      "Ġsign": 1265,
      "get": 1266,
      "Ġed": 1267,
      "sitive": 1268,
      "Ġcorrespon": 1269,
      "Ġmin": 1270,
      "ern": 1271,
      "\\geq": 1272,
      "chi": 1273,
      "Ġchan": 1274,
      "ength": 1275,
      "ib": 1276,
      "denti": 1277,
      "max": 1278,
      "Ġreal": 1279,
      "Ġdistribu": 1280,
      "ral": 1281,
      "ough": 1282,
      "Ġparameter": 1283,
      "Ġsol": 1284,
      "ormal": 1285,
      "Ġdefined": 1286,
      "\\m": 1287,
      "sim": 1288,
      "Ġvalues": 1289,
      "Ġcontain": 1290,
      "ink": 1291,
      "ĠSe": 1292,
      "Ġgeneral": 1293,
      "ob": 1294,
      "sk": 1295,
      "Ġlike": 1296,
      "appa": 1297,
      "ates": 1298,
      "ural": 1299,
      "eter": 1300,
      "ult": 1301,
      "Ġcomm": 1302,
      "valu": 1303,
      "ew": 1304,
      "Ġunder": 1305,
      "Ġ\\d": 1306,
      "err": 1307,
      "Ġclo": 1308,
      "Ġsequ": 1309,
      "Ġvector": 1310,
      "omorph": 1311,
      "Lambda": 1312,
      "Ġestima": 1313,
      "Ġfa": 1314,
      "lemma": 1315,
      "tal": 1316,
      "\\rangle": 1317,
      "rect": 1318,
      "####": 1319,
      "Ġrequ": 1320,
      "Ġstar": 1321,
      "vec": 1322,
      "tance": 1323,
      "ĠZ": 1324,
      "Ġabove": 1325,
      "Ġ\\(": 1326,
      "ha": 1327,
      "ere": 1328,
      "ĠCon": 1329,
      "ely": 1330,
      "\\cal": 1331,
      "mbox": 1332,
      "Ġsolution": 1333,
      "Ġmatrix": 1334,
      "ilar": 1335,
      "'$": 1336,
      "Ġinv": 1337,
      "Ġsupp": 1338,
      "Ġcre": 1339,
      "```": 1340,
      "Ġpri": 1341,
      "mpl": 1342,
      "Ġ\\{": 1343,
      "Ġstruct": 1344,
      "Ġtri": 1345,
      "gorithm": 1346,
      "pr": 1347,
      "round": 1348,
      "Ġran": 1349,
      "thm": 1350,
      "no": 1351,
      "fine": 1352,
      "be": 1353,
      "dic": 1354,
      "Ġwell": 1355,
      "cle": 1356,
      "sw": 1357,
      "Ġ\\emph": 1358,
      "Ġcomplex": 1359,
      "rodu": 1360,
      "ensure": 1361,
      "ĠĠĠĠĠ": 1362,
      "ensuremath": 1363,
      "Ġdoes": 1364,
      "Ġthrough": 1365,
      "Ġ\\l": 1366,
      "Ġsmall": 1367,
      "late": 1368,
      "\\ldots": 1369,
      "\\le": 1370,
      "Ġsur": 1371,
      "rue": 1372,
      "\\;": 1373,
      "Con": 1374,
      "ia": 1375,
      "Ġq": 1376,
      "vers": 1377,
      "col": 1378,
      "Ġcompu": 1379,
      "Ġbeen": 1380,
      "Ġobser": 1381,
      "Ġfinite": 1382,
      "Ġself": 1383,
      "tern": 1384,
      "oun": 1385,
      "size": 1386,
      "fer": 1387,
      "que": 1388,
      "Ġconsta": 1389,
      "Ġ\\cdot": 1390,
      "cts": 1391,
      "Ġprob": 1392,
      "Ġpoints": 1393,
      "fi": 1394,
      "Ġwor": 1395,
      "Ġbec": 1396,
      "tand": 1397,
      "ause": 1398,
      "Ġext": 1399,
      "Ġthem": 1400,
      "To": 1401,
      "&=": 1402,
      "Ġ\\to": 1403,
      "return": 1404,
      "\\Big": 1405,
      "nders": 1406,
      "Ġstud": 1407,
      "ue": 1408,
      "Ġconst": 1409,
      "Ġgroup": 1410,
      "Ġfunctions": 1411,
      "Re": 1412,
      "Ġvariable": 1413,
      "Ġ\\times": 1414,
      "entation": 1415,
      "Ġsince": 1416,
      "itial": 1417,
      "\\otimes": 1418,
      "ying": 1419,
      "Ġ\\v": 1420,
      "ndom": 1421,
      "\\boldsymbol": 1422,
      "ven": 1423,
      "Ġcontinu": 1424,
      "ĠLemma": 1425,
      "Ġeffe": 1426,
      "fter": 1427,
      "Ġta": 1428,
      "ĠAs": 1429,
      "mark": 1430,
      "Ġuni": 1431,
      "vert": 1432,
      "side": 1433,
      "Ġmultip": 1434,
      "Ġser": 1435,
      "Ġmax": 1436,
      "own": 1437,
      "Ġhis": 1438,
      "Ġpossi": 1439,
      "ness": 1440,
      "Ġidenti": 1441,
      "mon": 1442,
      "py": 1443,
      "Ġ\\int": 1444,
      "Ġbu": 1445,
      "''": 1446,
      "lem": 1447,
      "ines": 1448,
      "Ġlinear": 1449,
      "nderstand": 1450,
      "tt": 1451,
      "ert": 1452,
      "xt": 1453,
      "Pro": 1454,
      "\\section": 1455,
      "wh": 1456,
      "ĉĉĉ": 1457,
      "ron": 1458,
      "Ġoperator": 1459,
      "Ġfield": 1460,
      "Ġke": 1461,
      "data": 1462,
      "Ġexper": 1463,
      "Ġmy": 1464,
      ":=": 1465,
      "Ġima": 1466,
      "ater": 1467,
      "Ġnow": 1468,
      "\\bm": 1469,
      "Ġdeter": 1470,
      "Ġlim": 1471,
      "Ġdescri": 1472,
      "ression": 1473,
      "Ġmost": 1474,
      "energy": 1475,
      "Ġsecond": 1476,
      "Ġrequi": 1477,
      "Ġexists": 1478,
      "zeta": 1479,
      "bit": 1480,
      "Ġpositive": 1481,
      "ficient": 1482,
      "Ġlocal": 1483,
      "Ġhand": 1484,
      "~$": 1485,
      "Ġconne": 1486,
      "ities": 1487,
      "If": 1488,
      "Ġshould": 1489,
      "rite": 1490,
      "ival": 1491,
      "Ġlow": 1492,
      "ks": 1493,
      ":**": 1494,
      "ower": 1495,
      "rho": 1496,
      "Ġfra": 1497,
      "Ġtech": 1498,
      "Ġinformation": 1499,
      "Ġsing": 1500,
      "ner": 1501,
      "Ġ\\big": 1502,
      "mula": 1503,
      "Ġlear": 1504,
      "ynom": 1505,
      "heck": 1506,
      "let": 1507,
      "yle": 1508,
      "^k": 1509,
      "'t": 1510,
      "Ġbel": 1511,
      "ĠHow": 1512,
      "Ġhy": 1513,
      "Ġcondition": 1514,
      "\\,\\": 1515,
      "Ġparticular": 1516,
      "cm": 1517,
      "ically": 1518,
      "\\subsection": 1519,
      "ep": 1520,
      "lies": 1521,
      "Ġinclu": 1522,
      "Ġmany": 1523,
      "Ġmeasure": 1524,
      "//": 1525,
      "\\langle": 1526,
      "plit": 1527,
      "Ġeven": 1528,
      "Ġhel": 1529,
      "ĠFig": 1530,
      "Ġwere": 1531,
      "âĤ": 1532,
      "Ġredu": 1533,
      "Ġmap": 1534,
      "peratorname": 1535,
      "{\\": 1536,
      "Ġwhile": 1537,
      "ology": 1538,
      "ĠĠĊ": 1539,
      "ax": 1540,
      "Ġher": 1541,
      "__": 1542,
      "Ġtotal": 1543,
      "urther": 1544,
      "ymme": 1545,
      "rit": 1546,
      "Ġcalcu": 1547,
      "ining": 1548,
      "ive": 1549,
      "umbers": 1550,
      "ctively": 1551,
      "Ġincre": 1552,
      "fo": 1553,
      "arch": 1554,
      "Ġright": 1555,
      "Ġdepend": 1556,
      "As": 1557,
      "ĠEx": 1558,
      "Ġder": 1559,
      "Ġapproach": 1560,
      "ings": 1561,
      "umn": 1562,
      "cial": 1563,
      "Ġoptim": 1564,
      "velop": 1565,
      "\\|_{": 1566,
      "Ġcharact": 1567,
      "ĠBy": 1568,
      "theorem": 1569,
      "Ġterms": 1570,
      "Ġmain": 1571,
      "xima": 1572,
      "(\\": 1573,
      "Ġconstant": 1574,
      "^+": 1575,
      "Ġca": 1576,
      "ĠčĊ": 1577,
      "bo": 1578,
      "Ġtak": 1579,
      "\\Phi": 1580,
      "Ġ\\geq": 1581,
      "Ġsequence": 1582,
      "pre": 1583,
      "with": 1584,
      "Ġwa": 1585,
      "Ġ\\|": 1586,
      "Ġwhat": 1587,
      "ific": 1588,
      "Ġcould": 1589,
      "vity": 1590,
      "rightarrow": 1591,
      "antum": 1592,
      "\\log": 1593,
      "\\widetilde": 1594,
      "ull": 1595,
      "Ġam": 1596,
      "cur": 1597,
      "rate": 1598,
      "by": 1599,
      "ress": 1600,
      "asi": 1601,
      "ang": 1602,
      "\\)": 1603,
      "ision": 1604,
      "/\\": 1605,
      "ering": 1606,
      "Ġalgebra": 1607,
      "\\Lambda": 1608,
      "Ġ\\alpha": 1609,
      "Ġtype": 1610,
      "ency": 1611,
      "Ġprovid": 1612,
      "Ġ\\le": 1613,
      "Ġscal": 1614,
      "over": 1615,
      "ysis": 1616,
      "Ġerr": 1617,
      "Ġthree": 1618,
      "Ġminim": 1619,
      "ij": 1620,
      "Ġend": 1621,
      "map": 1622,
      "Ġinitial": 1623,
      "Ġrandom": 1624,
      "Ġdiv": 1625,
      "Ġdefine": 1626,
      "play": 1627,
      "Ġenergy": 1628,
      "\\kappa": 1629,
      "Ġlarge": 1630,
      "Ġconver": 1631,
      "hen": 1632,
      "Ġtest": 1633,
      "Ġmust": 1634,
      "Âł": 1635,
      "star": 1636,
      "\\chi": 1637,
      "ac": 1638,
      "Ġinteg": 1639,
      "rent": 1640,
      "ded": 1641,
      "etwork": 1642,
      "Ġcons": 1643,
      "Ġ\\quad": 1644,
      "ins": 1645,
      "style": 1646,
      "Ġway": 1647,
      "ross": 1648,
      "lock": 1649,
      "onumber": 1650,
      "ĊĊĊĊ": 1651,
      "Ġexist": 1652,
      "Ġlead": 1653,
      "Ġallow": 1654,
      "Ġdistribution": 1655,
      "istic": 1656,
      "TA": 1657,
      "\\lim": 1658,
      "Ġsection": 1659,
      "gs": 1660,
      "Ġdeg": 1661,
      "ick": 1662,
      "Ġunderstand": 1663,
      "Ġdimension": 1664,
      "Ġbased": 1665,
      "Ġalgorithm": 1666,
      "Ġfo": 1667,
      "Ġ&=": 1668,
      "Ġstructure": 1669,
      "Ġpair": 1670,
      "dx": 1671,
      "wa": 1672,
      "otential": 1673,
      "prime": 1674,
      "\\Sigma": 1675,
      "see": 1676,
      "swer": 1677,
      "ented": 1678,
      "Ġnumbers": 1679,
      "\\u": 1680,
      "Ġmaxim": 1681,
      "Ġ\\<": 1682,
      "ption": 1683,
      "Ġtop": 1684,
      "Ġprobability": 1685,
      "\\quad": 1686,
      "inal": 1687,
      "\\cite": 1688,
      "angle": 1689,
      "tices": 1690,
      "Ġcompon": 1691,
      "Ġlength": 1692,
      "Ġinput": 1693,
      "Ġpossible": 1694,
      "prop": 1695,
      "redic": 1696,
      "Ġmake": 1697,
      "Ġpaper": 1698,
      "qquad": 1699,
      "Ġpart": 1700,
      "Ġback": 1701,
      "ars": 1702,
      "Ġsize": 1703,
      "ditions": 1704,
      "not": 1705,
      "exp": 1706,
      "yp": 1707,
      "bility": 1708,
      "Ġfix": 1709,
      "\\caption": 1710,
      "Ġformula": 1711,
      "Ġelement": 1712,
      "tations": 1713,
      "box": 1714,
      "Ġide": 1715,
      "Ġsimilar": 1716,
      "\\ensuremath": 1717,
      "Ġbecause": 1718,
      "ased": 1719,
      "Ġprove": 1720,
      "ese": 1721,
      "try": 1722,
      "Ġstand": 1723,
      "Ġ--": 1724,
      "Ġ:=": 1725,
      "king": 1726,
      "Ġcorresponding": 1727,
      "ii": 1728,
      "ĠÎ": 1729,
      "Ġindu": 1730,
      "Ġdec": 1731,
      "Ġmon": 1732,
      "TE": 1733,
      "gram": 1734,
      "ĠSince": 1735,
      "Ġequival": 1736,
      "onal": 1737,
      "cing": 1738,
      "teq": 1739,
      "ĠAn": 1740,
      "Ġelements": 1741,
      "ĠDe": 1742,
      "des": 1743,
      "verse": 1744,
      "ging": 1745,
      "lying": 1746,
      "lot": 1747,
      "lear": 1748,
      "ati": 1749,
      "Ġins": 1750,
      "ren": 1751,
      "Ġdenote": 1752,
      "Ġnp": 1753,
      "\\dots": 1754,
      "vious": 1755,
      "umerate": 1756,
      "Ġ\\mathbf": 1757,
      "Ġsum": 1758,
      "Ġcir": 1759,
      "chan": 1760,
      "read": 1761,
      "Ġtheorem": 1762,
      "ĠCh": 1763,
      "ĠâĢ": 1764,
      "em": 1765,
      "Ġcode": 1766,
      "Ġ\\lambda": 1767,
      "rong": 1768,
      "\\vec": 1769,
      "Ġapproxima": 1770,
      "Ġ\\sub": 1771,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1772,
      "inst": 1773,
      "Ġzero": 1774,
      "Ġleft": 1775,
      "\\nabla": 1776,
      "==": 1777,
      "va": 1778,
      "seteq": 1779,
      "ton": 1780,
      "Ġcharacter": 1781,
      "lass": 1782,
      "Ġdevelop": 1783,
      "ined": 1784,
      "Ġques": 1785,
      "Ġwho": 1786,
      "Ġmat": 1787,
      "sequ": 1788,
      "Ġimpor": 1789,
      "\\zeta": 1790,
      "Ġshe": 1791,
      "face": 1792,
      "ode": 1793,
      "Ġpotential": 1794,
      "oll": 1795,
      "ynam": 1796,
      "Ġlog": 1797,
      "ĠTo": 1798,
      "uch": 1799,
      "ule": 1800,
      "upp": 1801,
      "lus": 1802,
      "Ġderiv": 1803,
      "Ġste": 1804,
      "ĠâĪ": 1805,
      "tant": 1806,
      "pendent": 1807,
      "ape": 1808,
      "Ġpower": 1809,
      "ensity": 1810,
      "oc": 1811,
      "Ġ\\h": 1812,
      "\\rightarrow": 1813,
      "Ġhelp": 1814,
      "elds": 1815,
      "Ġequal": 1816,
      "Ġquantum": 1817,
      "olutions": 1818,
      "Ġimplies": 1819,
      "Ġnat": 1820,
      "quare": 1821,
      "scr": 1822,
      "Ġpath": 1823,
      "Ġlist": 1824,
      "ynomial": 1825,
      "Ġassume": 1826,
      "atch": 1827,
      "ff": 1828,
      "It": 1829,
      "ward": 1830,
      "Ġcom": 1831,
      "graphics": 1832,
      "Ġ\\]": 1833,
      "Ġbo": 1834,
      "Ġlong": 1835,
      "Ġobject": 1836,
      "Ġremain": 1837,
      "ences": 1838,
      "soci": 1839,
      "vari": 1840,
      "dd": 1841,
      "textit": 1842,
      "lations": 1843,
      "Ġconditions": 1844,
      "enumerate": 1845,
      "âĢĻ": 1846,
      "Ġcomb": 1847,
      "finition": 1848,
      "Ġintrodu": 1849,
      "Ġsimple": 1850,
      "wise": 1851,
      "roup": 1852,
      "Ġproduct": 1853,
      "df": 1854,
      "Ġpr": 1855,
      "Ġcalled": 1856,
      "div": 1857,
      "Ġjust": 1858,
      "Ġnetwork": 1859,
      "rest": 1860,
      "Co": 1861,
      "Ġau": 1862,
      "rol": 1863,
      "igen": 1864,
      "Ġinequ": 1865,
      "sive": 1866,
      "minus": 1867,
      "Ġdiscus": 1868,
      "cludegraphics": 1869,
      "Ġgre": 1870,
      "\\pm": 1871,
      "thon": 1872,
      "Ġanswer": 1873,
      "Ġadd": 1874,
      "Ex": 1875,
      "Ġtheory": 1876,
      "dis": 1877,
      "Ġorig": 1878,
      "ily": 1879,
      "Ġanalysis": 1880,
      "Ġfound": 1881,
      "tics": 1882,
      "ath": 1883,
      "Ġshown": 1884,
      "less": 1885,
      "By": 1886,
      "ĠCo": 1887,
      "Ġrange": 1888,
      "Ġapplic": 1889,
      "fy": 1890,
      "new": 1891,
      "nces": 1892,
      "oid": 1893,
      "mpty": 1894,
      "ĠĠThe": 1895,
      "Ġhad": 1896,
      "Ġsen": 1897,
      "ons": 1898,
      "Ġholds": 1899,
      "cip": 1900,
      "Ġcent": 1901,
      "Ġterm": 1902,
      "lated": 1903,
      "Ġ==": 1904,
      "Ġbi": 1905,
      "ng": 1906,
      "ordin": 1907,
      "Ġag": 1908,
      "edge": 1909,
      "Ġobtained": 1910,
      "Ġspa": 1911,
      "Ġargu": 1912,
      "\\widehat": 1913,
      "Ġopen": 1914,
      "Ġmodels": 1915,
      "tional": 1916,
      "ild": 1917,
      "Ġhere": 1918,
      "Ġpe": 1919,
      "equiv": 1920,
      "ĠHowever": 1921,
      "^d": 1922,
      "ene": 1923,
      "Ġread": 1924,
      "cript": 1925,
      "print": 1926,
      "Ġstates": 1927,
      "Now": 1928,
      "Ġaddition": 1929,
      "else": 1930,
      "\\textbf": 1931,
      "Ġstep": 1932,
      "setminus": 1933,
      "els": 1934,
      "mis": 1935,
      "imp": 1936,
      "top": 1937,
      "Ġafter": 1938,
      "tice": 1939,
      "\\includegraphics": 1940,
      "finite": 1941,
      "ster": 1942,
      "Ġexact": 1943,
      "Ġrest": 1944,
      "partial": 1945,
      "Ġsample": 1946,
      "ain": 1947,
      "Ġexpe": 1948,
      "test": 1949,
      "Ġequations": 1950,
      "ĠSection": 1951,
      "tribu": 1952,
      "ategor": 1953,
      "ĠAl": 1954,
      "\\operatorname": 1955,
      "Ġge": 1956,
      "Ġproperties": 1957,
      "Ġassoci": 1958,
      "cept": 1959,
      "Ġ``": 1960,
      "dimension": 1961,
      "Ġparameters": 1962,
      "cup": 1963,
      "lect": 1964,
      "ext": 1965,
      "Since": 1966,
      "alle": 1967,
      "type": 1968,
      "Ġanaly": 1969,
      "\\x": 1970,
      "Ġ\\m": 1971,
      "Ġtake": 1972,
      "jective": 1973,
      "Ġlevel": 1974,
      "\\|\\": 1975,
      "ark": 1976,
      "Ġcontra": 1977,
      "Ġsymme": 1978,
      "Ġdetermin": 1979,
      "Ġdefinition": 1980,
      "ied": 1981,
      "\\t": 1982,
      "lish": 1983,
      "âľ": 1984,
      "Then": 1985,
      "itu": 1986,
      "âľĿ": 1987,
      "war": 1988,
      "Ġnext": 1989,
      "\"\"\"": 1990,
      "other": 1991,
      "Ġrespectively": 1992,
      "lat": 1993,
      "^i": 1994,
      "ensor": 1995,
      "und": 1996,
      "vation": 1997,
      "jo": 1998,
      "uto": 1999,
      "<\\": 2000,
      "###": 2001,
      "ass": 2002,
      "sla": 2003,
      "split": 2004,
      "\\mbox": 2005,
      "Ġlimit": 2006,
      "Ġerror": 2007,
      "Ġ\\sqrt": 2008,
      "Ġgu": 2009,
      "Ġspect": 2010,
      "Ġleast": 2011,
      "Ġwithin": 2012,
      "mooth": 2013,
      "Ġrespect": 2014,
      "ĉĉĉĉ": 2015,
      "ont": 2016,
      "ngu": 2017,
      "requ": 2018,
      "Ġpredic": 2019,
      "Ġthose": 2020,
      "omorphism": 2021,
      "uring": 2022,
      "from": 2023,
      "ither": 2024,
      "Ġradi": 2025,
      "ov": 2026,
      "ture": 2027,
      "Ġ&\\": 2028,
      "Ġweight": 2029,
      "fore": 2030,
      "']": 2031,
      "\\<": 2032,
      "~~": 2033,
      "Ġshows": 2034,
      "call": 2035,
      "egative": 2036,
      "indent": 2037,
      "Ġtas": 2038,
      "Ġsolutions": 2039,
      "Ġsets": 2040,
      "ĠThus": 2041,
      "lack": 2042,
      "Ġdeta": 2043,
      "Ġfam": 2044,
      "Ġsystems": 2045,
      "Ġnormal": 2046,
      "ĠĊĠ": 2047,
      "Ġoper": 2048,
      "Ġdire": 2049,
      "atures": 2050,
      "anti": 2051,
      "verage": 2052,
      "^{-\\": 2053,
      "Ġgives": 2054,
      "Ġ\\mu": 2055,
      "Ġmass": 2056,
      "Ġ\\beta": 2057,
      "Ġkey": 2058,
      "Ġtyp": 2059,
      "Ġbeing": 2060,
      "view": 2061,
      "Ġsingle": 2062,
      "Ġcy": 2063,
      "Ġmath": 2064,
      "Ġprovide": 2065,
      "ĠâĨ": 2066,
      "Ġent": 2067,
      "Ġhom": 2068,
      "Ġinsta": 2069,
      "Ġ\\P": 2070,
      "Ġwithout": 2071,
      "mat": 2072,
      "mi": 2073,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2074,
      "Ġsk": 2075,
      "ĠTherefore": 2076,
      "Ġmeans": 2077,
      "Ġfactor": 2078,
      "Ġconstru": 2079,
      "oindent": 2080,
      "Ġ\\sigma": 2081,
      "Ġnatural": 2082,
      "\\ge": 2083,
      "Ġexpression": 2084,
      "Vert": 2085,
      "yer": 2086,
      "Ġmethods": 2087,
      "odes": 2088,
      "Ġvery": 2089,
      "Ġdown": 2090,
      "thing": 2091,
      "\\draw": 2092,
      "Ġdistance": 2093,
      "Ġlangu": 2094,
      "\\mathsf": 2095,
      "lob": 2096,
      "Ġ\\delta": 2097,
      "Ġdue": 2098,
      "Ġindic": 2099,
      "rid": 2100,
      "Le": 2101,
      "ental": 2102,
      "file": 2103,
      "action": 2104,
      "bor": 2105,
      "Ġstandard": 2106,
      "Ġcost": 2107,
      "\\cdots": 2108,
      "reak": 2109,
      "Ġknown": 2110,
      "Ġunique": 2111,
      "Ġcontinuous": 2112,
      "Ġimpro": 2113,
      "fun": 2114,
      "Ġtre": 2115,
      "Ġstrong": 2116,
      "flo": 2117,
      "Ġaga": 2118,
      "Ġcomplete": 2119,
      "ques": 2120,
      "Ġtrue": 2121,
      "Ġfixed": 2122,
      "Ġdeno": 2123,
      "Ġsignific": 2124,
      "ource": 2125,
      "Ġedge": 2126,
      "ĠSo": 2127,
      "Ġ\\mathrm": 2128,
      "sto": 2129,
      "Ġspecific": 2130,
      "Ġ\\[": 2131,
      "Ġcoef": 2132,
      "Ġcommun": 2133,
      "tis": 2134,
      "Ġcar": 2135,
      "ration": 2136,
      "Ġdirect": 2137,
      "pic": 2138,
      "Ġ\\pi": 2139,
      "\\_": 2140,
      "ils": 2141,
      "iod": 2142,
      "ollary": 2143,
      "asing": 2144,
      "Ġrate": 2145,
      "Ġrelations": 2146,
      "Ġinvol": 2147,
      "io": 2148,
      "Ġmag": 2149,
      "Ġtimes": 2150,
      "Ġtemp": 2151,
      "ertain": 2152,
      "Ġadv": 2153,
      "Ġsuf": 2154,
